Pruned and corrected getting started docs
